{
    "app_category": {
        "query":["Hi! How can I help you today?","Hi! What brings you here today?",
                "Hey there! How can I help you out today?",
                "Hello! How may I assist you today?"],
        "text": {"1":["I'm looking for a $X for my Android phone. Any suggestions?",
                    "I am interested in $X that are compatible with Android.",
                    "Searching for $X that support Android devices.","I'd like to find $X that works on Android. Any ideas?",
                    "I'm interested in finding $X that works with Android. Any recommendation?"],
                "0":["Not really, I don't have a specific category in mind when installing apps.",
                "I don't have a strong preference for specific app categories.", "Not really, I don't have a preferred app cetegory."]
    }},
    "content_rating": {
        "query":["Do you have any preferences for the apps content rating?",
                "Can you specify the content rating of the app?", "Do you have a preference for apps content rating?",
                "Is there a specific content rating you prefer?", "Do you have any specific content rating in mind for the app?"],
        "text": {"1":["I am looking apps for $X.","$X would be preferable for me.",
                "I prefer apps with a rating of $X.","I generally prefer apps with a rating of $X.",
                "$X is the content rating I prefer for apps."],
                "0":["I dont care about the content rating.","I am okay with any content rated apps."]
    }},
    "does_have_ads": {
        "query":["Okay, Do you mind if the app has ads?", "Sure, are you okay if the app includes ads?",
                "Hmm, are you comfortable with intermittent ads in the app?", "Alright, are you fine with ads being shown in the app?",
                "Are you okay with occasional ads in the app?", "Got it! What about ads?"],
        "text": {"1":["I'm open to explore apps that $X.","I'm willing to consider apps that include $X.",
                "Certainly, I'm okay with apps that $X.","I don't mind few ads.","I'm okay with apps showing a few ads."],
                "0":["I don't pay much attention to the advertising feature.","I actively avoid apps with too many ads."]
    }},
    "num_reviews": {
        "query":["Okay. How about the number of reviews?","Sure, what about the number of reviews?",
                "Are you interested in apps with many reviews?",
                "Do you care about the app having many reviews?","How many reviews are you looking at?",
                "What's your preference regarding the number of reviews?"],
        "text": {"1":["I generally prefer app when it has at least $X reviews",
                "I usually look for apps with a minimum of $X user reviews.",
                "I'd prefer an app that's popular and has at least $X reviews.",
                "I prefer apps that have a significant number of reviews, such as $X."],
                "0":["I don't really pay much attention to the number of reviews.","I rarely check the number of reviews.",
                "The number of reviews doesn't matter much to me."]
    }},
    "price": {
        "query":["Do you prefer free apps, or are you willing to pay for extra features?",
                "Would you prefer a free app or willing to pay for additional features?",
                "Are you interested in a free app or would you consider paying for additional features?",
                "Do you prefer free apps or are you open to paying for premium features?",
                "Are you looking for free or paid version?"],
        "text":{"1": ["I generally prefer using $X apps.","I prefer $X apps.", "I generally like using $X apps.",
                "$X is preferable.", "$X would be ideal.", "I'm usually more into $X apps."],
                "0":["I don't have a strong preference about apps price.","Whether an app is free or paid doesn't matter much to me.",
                "Free or paid, it doesn't impact my decision much."]
    }},
    "avg_rating": {
        "query":["Would you prefer an app with a high average rating from users?",
                "What average rating are you looking for?", 
                "Absolutely! Are you looking for an app with a particular average rating?",
                "Got it! Are you looking for an app with a specific average rating?",
                "Understood. How important is the average rating of the app to you? "],
        "text": {"1":["I usually look for mobile apps with an average rating of $X starts or higher.",
                "I look for apps with a minimum $X star average rating.","I like apps that have at least a $X star average rating.",
                "I prefer apps with high ratings, around $X stars or above."],
                "0":["I don't pay much attention to average ratings.","Average ratings don't really influence my decision.","Average ratings don't matter to me."]
    }}
}
