{
    "app_category": {
        "question": ["Could you please specify the category of the suggested mobile app?",
                    "Could you let me know which category the application belongs to?",
                    "What category does the mobile application fall under?",
                    "Which category best describes this app?"],
        "response": ["The recommended mobile application falls under the $X category.","The suggested app is in the $X category.",
                    "The recommended mobile app falls into the $X category."]
    },
    "content_rating": {
        "question": ["Could you please provide information about the content rating of the recommended mobile application?",
                    "I'd like to know more about the content rating of the recommended mobile app.",
                    "What is the content rating of the recommended mobile application?"],
        "response": ["The recommended mobile application is primarily targeted for $X.","The recommended app is suitable for $X.",
                    "The recommended mobile application has been rated for $X.",
                    "Certainly, the content rating assigned to the recommended mobile app is for $X."]
    },
    "does_have_ads": {
        "question": ["Could you clarify whether the mobile application supports advertisements?",
                    "Can you provide information about the advertising features available in the mobile application?",
                    "Does the mobile application provide any advertising features?"],
        "response": ["Certainly! the mobile application $X.","Yes, the mobile application $X."]
    },
    "num_reviews": {
        "question": ["Can you provide information on the total number of reviews for the mobile application??",
                    "What is the current count of user reviews for the mobile app?",
                    "How many reviews has the mobile application accumulated so far?","What's the review count for the app so far?"],
        "response": ["As of now, the mobile application has received a total of $X reviews from users.",
                    "The current count of user reviews for the mobile app is $X.",
                    "The mobile application has garnered $X reviews from users."]
    },
    "price": {
        "question": ["Is the mobile application available for free, or does it involve any paid subscription?",
                    "Could you please provide information on the pricing model for the mobile app?",
                    "Are there any in-app purchases, subscription plans, or is it entirely free to use?"],
        "response": ["The mobile application is $X to download and use.",
                    "Certainly! The mobile app is designed with a $X version that covers the core features.",
                    "Yes, we have a $X version of the mobile app that includes essential features."]
    },
    "avg_rating": {
        "question": ["What is the average rating of the mobile application according to user reviews?",
                    "Could you provide the average user rating for the recommended mobile app?",
                    "Can you give me an idea of how users have rated the recommended mobile app on average?",
                    "What is its average rating based on user reviews?"],
        "response": ["The app has a general rating of $X","The average rating for the app is $X.",
                    "The recommended app has an average rating of $X."]
    },
    "data_collected": {
        "question": ["What types of data does the mobile application collect from users?",
                    "What type of information does the app collect?",
                    "What are the primary information that this app collect?",
                    "Could you provide an overview of the information the app collects from users?"],
        "response": ["The application may collect information about the user's $X.","The app collects data, including $X.",
                    "The mobile application collects $X."]
    },
    "data_collected_detail": {
        "question": ["Please provide the details of the data collected for $Y?",
                    "Could you please provide details on how the application collects data for $Y?",
                    "Can you provide more details about the data collected for $Y",
                    "Could you provide details on the $Y data collected by the app?"],
        "response": ["Details of the data collected by the app for $X.",
                    "The specifics of the information gathered by the application regarding $X."]
    },
    "data_collected_purpose": {
        "question": ["Please tell me what is the purpose of the data collected by the app for $Y?",
                    "What is the purpose of the data collected by the app for $Y?",
                    "Please specify the purpose of the data collection by the app for $Y?",
                    "What is the primary purpose of collecting user data for $Y?"],
        "response": ["The main purpose of the data collected by the app for $X.",
                    "The primary purpose of collecting user data by this app for $X."]
    },
    "data_shared": {
        "question": ["What types of data are shared by this app with third-parties?",
                    "What kind of information does the app share with third-parties?", 
                    "What types of data does the mobile application share with third parties?",
                    "Could you specify the types of data shared by this app with third-parties?"],
        "response": ["The mobile application shares $X with third parties","The app shares specific data such as $X with third parties.",
                    "Data shared by the application are $X."]
    },
    "data_shared_detail": {
        "question": ["Please provide the details of the data sharing for $Y?",
                    "Can you please provide more details about $Y that is shared with third parties by the mobile application?",
                    "Could you provide details on the $Y data shared by the app?"],
        "response": ["The details of data sharing by the application for $X.",
                    "The specifics of the information shared by the application regarding $X"]
    },
    "data_shared_purpose": {
        "question": [
                    "What is the purpose of the data shared by the app for $Y?",
                    "For what purposes does the application share user data for $Y with third parties?",
                    "What is the primary purpose of sharing user data for $Y with third parties?"
                   ],
        "response": ["The main purpose of sharing data in the app for $X.",
                    "The primary purpose of sharing user data by this app for $X."
                    ]
    },
    "permission": {
        "question": ["What permissions does the recommended mobile application require?",
                    "Could you please provide details about the access granted to the mobile app?",
                    "What level of access granted to this application?","What kind of information does the app have access to?"],
        "response": ["The mobile application requires access to $X.","The app requests permissions for accessing your device's $X.",
                    "Access granted to this mobile application includes $X."]
    },
    "permission_detail": {
        "question": ["Please elaborate the purpose of the permission for $Y?",
                    "Can you explain the necessity of $Y permission the app is asking for?",
                    "Can you clarify why the app requires access to the $Y?"],
        "response": ["The applications requires permission for $X.", "The access for the mobile applications is essential for $X."]
    }
}